{
  "backend/main.mo": "Main actor that combines blob storage, access control, and user approval mixins; provides user profile management and approval endpoints with role-based authorization checks.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend components, hooks, and pages describing their functionality and implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point that loads the React application from /src/main.tsx with the title 'NEXY_MYNDIS CONCIERGE'.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, role-based dashboard routing, onboarding flow overlay with localStorage persistence, and page transitions.",
  "frontend/src/components/admin/AIMetricsOverview.tsx": "Dashboard component displaying AI agent performance metrics including validation accuracy, false positive/negative rates, processing time, and confidence scores in card layouts.",
  "frontend/src/components/admin/ThresholdConfigurationPanel.tsx": "Admin panel for configuring AI validation thresholds including budget warnings, anomaly sensitivity, and compliance strictness with sliders and save/reset functionality.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with query cache clearing and localStorage cleanup on logout.",
  "frontend/src/components/auth/ProfileSetup.tsx": "A deprecated dialog component for collecting user profile information (name, email, role) during initial setup. Uses form validation and mutation hooks to save the profile to the backend.",
  "frontend/src/components/auth/RoleSelector.tsx": "Displays a role selection interface with four predefined roles (NDIS Participant, Guardian/Carer, Service Provider, Plan Manager) and assigns the selected role to the authenticated user via Internet Identity.",
  "frontend/src/components/booking/AIBookingEstimator.tsx": "Displays AI-generated booking estimates including duration, cost, budget category, and remaining funds in a card layout with icons.",
  "frontend/src/components/booking/AIServiceSuggestions.tsx": "Shows AI-recommended services with pricing, budget fit ratings, and goal alignment percentages in a card-based list format.",
  "frontend/src/components/booking/AITimeSlotRecommendations.tsx": "Presents AI-recommended time slots with confidence scores and reasoning, allowing users to select preferred booking times.",
  "frontend/src/components/common/DemoModeBadge.tsx": "Empty component file with no implementation.",
  "frontend/src/components/common/LoadingSkeleton.tsx": "A reusable skeleton loader component with customizable width, height, and shimmer animation for loading states.",
  "frontend/src/components/common/LoadingState.tsx": "Displays a loading spinner with optional timeout handling that shows an error message and refresh button if loading exceeds the specified duration.",
  "frontend/src/components/common/PageTransition.tsx": "Wraps children with fade-in and slide-up animation classes for page transition effects.",
  "frontend/src/components/common/ScrollReveal.tsx": "Uses IntersectionObserver to animate child elements with fade-in and slide-up effects when they scroll into view.",
  "frontend/src/components/common/ValidationExplanationModal.tsx": "A modal dialog that displays detailed budget validation results including transaction details, approval/rejection status, reasons, and warnings with color-coded badges and icons.",
  "frontend/src/components/guardian/AIBudgetPredictions.tsx": "Displays AI-generated budget predictions including depletion forecast, utilization rate progress bar, and recommendations in a card layout.",
  "frontend/src/components/guardian/AIPriorityParticipants.tsx": "Shows a prioritized list of participants with urgency levels (high/medium/low), reasons for priority, and action buttons in color-coded cards.",
  "frontend/src/components/guardian/AIRiskAssessmentCard.tsx": "Displays AI-generated risk assessments for participants with color-coded risk levels (high/medium/low), risk factors, and recommendations using fake data.",
  "frontend/src/components/invoice/AICompletenessChecker.tsx": "Shows a checklist card with AI-powered validation of invoice completeness, displaying pass/fail status for invoice number, participant, line items, and pricing.",
  "frontend/src/components/invoice/AILineItemSuggestions.tsx": "Provides AI-suggested line items for invoices (therapy sessions) with descriptions, quantities, and prices that can be added via callback.",
  "frontend/src/components/invoice/AIPricingValidator.tsx": "Validates line item prices against NDIS guidelines, showing success or warning icons with messages based on price range (0-500).",
  "frontend/src/components/landing/DemoVideoSection.tsx": "Landing page section with a clickable video thumbnail that opens a modal to play a platform demo video.",
  "frontend/src/components/landing/FeatureCardEnhanced.tsx": "Interactive feature card with 3D mouse tilt effect on desktop, displaying an icon, title, and description with gradient styling and hover animations.",
  "frontend/src/components/landing/FloatingParticles.tsx": "Renders animated particles that follow the mouse cursor with physics-based motion (velocity, damping, return force) on non-touch devices.",
  "frontend/src/components/landing/HeroParticles.tsx": "Canvas-based particle animation with moving dots and connecting lines between nearby particles, respecting reduced motion preferences with static fallback.",
  "frontend/src/components/landing/RippleButton.tsx": "Button component with Material Design-style ripple click effect that animates from the click position and fades out after 300ms.",
  "frontend/src/components/landing/TestimonialsCarousel.tsx": "Auto-rotating carousel component displaying user testimonials with star ratings, avatars, and navigation dots. Includes custom hooks for carousel logic and intersection observer functionality.",
  "frontend/src/components/landing/TrustIndicators.tsx": "Statistics section displaying animated counters for key metrics (users, budgets, satisfaction, support) with icons. Uses intersection observer to trigger count-up animations when scrolled into view.",
  "frontend/src/components/landing/VideoModal.tsx": "Modal component for displaying video content with backdrop blur and close button. Manages body scroll lock when open and handles click-outside-to-close behavior.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand info, navigation links (Quick Links, Legal), contact details, and social media icons. Includes dynamic year and app identifier for support email.",
  "frontend/src/components/layout/Header.tsx": "Fixed header navigation with logo, role-based dashboard links, mobile menu toggle, and login button. Dynamically adjusts navigation based on authentication status and user role.",
  "frontend/src/components/layout/PageLayout.tsx": "Main layout wrapper component that combines Header, Footer, and main content area with optional page title. Provides consistent page structure and gradient background.",
  "frontend/src/components/onboarding/CompletionScreen.tsx": "Onboarding completion screen with success icon, welcome message, and recommended next steps list. Includes button to navigate to dashboard after onboarding.",
  "frontend/src/components/onboarding/FeatureDemoScreen.tsx": "Onboarding screen showcasing three key features (Upload Plan, Find Providers, Book Services) with icons and descriptions, plus navigation buttons to continue or skip the tour.",
  "frontend/src/components/onboarding/NDISBasicsScreen.tsx": "Educational onboarding screen explaining NDIS plan fundamentals including plan structure, budget categories, service providers, and plan management concepts.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Main onboarding flow controller managing four sequential steps (Welcome, NDIS Basics, Features, Completion) with progress tracking and navigation.",
  "frontend/src/components/onboarding/WelcomeScreen.tsx": "Initial onboarding welcome screen introducing NEXY MYNDIS platform with four feature highlights (Manage Plan, Find Providers, Track Goals, Stay Compliant) in a grid layout.",
  "frontend/src/components/participant/AIInsightsCard.tsx": "Card component displaying AI-generated budget insights with categorized warnings, opportunities, and suggestions, each with appropriate icons and styling.",
  "frontend/src/components/participant/AIMilestoneAlertsCard.tsx": "Card showing AI-generated milestone alerts with priority levels (high/medium/low), countdown days, and recommended actions for upcoming plan events.",
  "frontend/src/components/participant/AIProviderRecommendations.tsx": "Card displaying AI-matched provider recommendations with match scores, specialties, availability, and click-through navigation to providers page.",
  "frontend/src/components/participant/BudgetHealthIndicator.tsx": "Card showing overall budget health status with utilization percentage, color-coded health indicators (healthy/warning/critical), progress bar, and active budget alerts display.",
  "frontend/src/components/participant/BudgetSummaryCard.tsx": "Displays a participant's NDIS budget overview including total allocated, spent, remaining amounts, and a visual progress bar with warnings when budget utilization exceeds 80%.",
  "frontend/src/components/participant/BudgetValidationAlert.tsx": "Shows budget validation results with success/warning/error states, displaying reasons for rejection, warnings, predicted depletion dates, and collapsible recommended adjustments.",
  "frontend/src/components/participant/GoalProgressCard.tsx": "Displays NDIS plan goals with visual progress bars showing completion percentage for each goal.",
  "frontend/src/components/participant/PlanOverviewCard.tsx": "Shows high-level NDIS plan information including plan number, status badge, start/end dates, and a list of goals.",
  "frontend/src/components/participant/UpcomingBookingsCard.tsx": "Lists upcoming service bookings with details like service type, provider, date/time, status badges, and pricing information.",
  "frontend/src/components/planmanager/AIComplianceMonitor.tsx": "Displays AI-generated compliance metrics including overall score, audit pass rates, and recent compliance checks with success indicators.",
  "frontend/src/components/planmanager/AIInvoiceRecommendations.tsx": "Shows AI-generated invoice processing recommendations with confidence scores, reasons, and action buttons for each suggested invoice.",
  "frontend/src/components/planmanager/AIPortfolioOptimization.tsx": "Presents AI-generated portfolio optimization opportunities categorized by impact level (High/Medium/Low) with descriptions and visual indicators.",
  "frontend/src/components/provider/AIBookingOptimization.tsx": "Displays AI-generated booking optimization insights including optimal time slots, service bundling suggestions, and efficiency tips in a card layout with icons.",
  "frontend/src/components/provider/AIClientNeedsPrediction.tsx": "Shows AI-powered demand forecasts for the next 30 days with service trends and recommendations, using color-coded trend indicators.",
  "frontend/src/components/provider/AICompatibilityBadge.tsx": "Renders a small badge displaying an AI compatibility score (0-100%) with color coding and tooltip, using a star icon.",
  "frontend/src/components/provider/AICompatibilityInsights.tsx": "Displays detailed AI compatibility analysis with metrics for service alignment, budget fit, availability match, and performance history in a grid layout.",
  "frontend/src/components/provider/AIFilterSuggestions.tsx": "Shows AI-generated filter suggestions with relevance badges (High/Medium/Low) to help users refine their search criteria.",
  "frontend/src/components/provider/AIRevenueAnalytics.tsx": "Presents AI revenue forecasts including predicted monthly revenue, growth trends, and key insights with visual metrics and trend indicators.",
  "frontend/src/components/provider/AnomalyWarningBanner.tsx": "Dismissible alert banner that displays AI-detected anomalies in invoices with a list of issues and warning styling.",
  "frontend/src/components/provider/ProviderCard.tsx": "Card component displaying service provider details including name, rating, services, NDIS verification status, and AI compatibility badge with a booking button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages ICP actor creation with authentication, handling both anonymous and authenticated actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Custom hook providing carousel functionality with auto-advance, manual navigation (next/prev/goTo), and pause/resume controls.",
  "frontend/src/hooks/useCountUp.ts": "Animation hook that smoothly counts up from 0 to a target number over a specified duration using easeOutCubic easing.",
  "frontend/src/hooks/useDemoMode.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom hook that uses IntersectionObserver API to detect when a referenced element enters the viewport, with configurable threshold and root margin.",
  "frontend/src/hooks/useMouseTilt.ts": "Custom hook that applies 3D tilt transform to an element based on mouse position, with smooth transitions and touch device detection.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that creates a parallax scrolling effect by translating an element based on scroll position, respecting reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, and NDIS-related data (participants, providers, bookings, budgets), with both real backend calls and mock implementations for unimplemented features.",
  "frontend/src/hooks/useUserRole.ts": "Provides a hook to access the current user's role and helper functions to check if the user is a participant, guardian, provider, plan manager, or admin.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for theming (light/dark modes), typography styles using Inter and Poppins fonts, and accessibility focus styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminAIAgentDashboard.tsx": "Admin-only page displaying AI agent performance metrics, validation statistics, and threshold configuration panel with role-based access control.",
  "frontend/src/pages/BookingPage.tsx": "Service booking page with form for scheduling appointments, including AI-powered time slot recommendations, service suggestions, and cost estimation (currently using mock data).",
  "frontend/src/pages/GetStartedPage.tsx": "Role selection page that displays four NDIS user roles (Participant, Guardian, Provider, Plan Manager) with features and navigates to registration based on selection. Redirects unauthenticated users to home.",
  "frontend/src/pages/GuardianDashboard.tsx": "Guardian dashboard displaying stats for managed participants, AI insights, bookings, and budget alerts with components for risk assessment, budget predictions, and priority participants. Fetches guardian data and budget threshold alerts.",
  "frontend/src/pages/InvoiceCreatePage.tsx": "Invoice creation form for service providers with dynamic line items, AI-powered suggestions, pricing validation, and completeness checking. Includes mock submission that navigates to dashboard on completion.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with animated hero section, parallax effects, floating particles, lazy-loaded testimonials and demo video sections. Redirects authenticated users to dashboard or get-started based on role.",
  "frontend/src/pages/ParticipantDashboard.tsx": "Participant dashboard showing NDIS plan overview, budget summary, goal progress, upcoming bookings, and AI-powered insights including provider recommendations and milestone alerts. Calculates total budget and spending from active plan categories.",
  "frontend/src/pages/PlanManagerDashboard.tsx": "Plan manager dashboard displaying managed participants, pending invoices, compliance score, and AI insights with components for compliance monitoring, invoice recommendations, and portfolio optimization. Shows stats grid with placeholder data.",
  "frontend/src/pages/PlanUploadPage.tsx": "Page component for uploading NDIS plan PDFs with progress tracking, file validation, and navigation to dashboard upon successful upload using ExternalBlob for file handling.",
  "frontend/src/pages/ProviderDashboard.tsx": "Provider dashboard page displaying bookings, invoices, anomaly warnings, and AI-powered analytics components including revenue analytics, booking optimization, and client needs prediction.",
  "frontend/src/pages/ProvidersPage.tsx": "Page for browsing and searching NDIS service providers with AI-powered filtering, compatibility insights, and mock provider data including ratings and service types.",
  "frontend/src/pages/RegistrationPage.tsx": "Multi-step registration form handling participant, provider, plan manager, and guardian role registration with Internet Identity authentication and profile creation.",
  "frontend/src/types/mock-types.ts": "TypeScript type definitions for NDIS-related entities including plans, bookings, budget categories, AI validation results, and guardian relationships.",
  "frontend/src/utils/fakeAIData.ts": "Utility functions generating mock AI-powered data including insights, milestone alerts, provider recommendations, risk assessments, and compliance metrics for UI development.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, spacing scale, border radius, shadows, and container settings.",
  "project_state.json": "Project metadata file tracking a pending feature request (AR-1) to retry a failed deployment process."
}