{
  "backend/main.mo": "Main Motoko actor implementing NDIS platform with user profiles, participants, providers, bookings, invoices, NDIS plans, budget tracking, compliance, and AI agent metrics. Includes mixins for storage and authorization with user approval workflows.",
  "feature_evidence.json": "Feature evidence report documenting removal of profile completion modal and its conditional logic from App.tsx and ProfileSetup.tsx, with high confidence and mapped test IDs REQ-1 and REQ-2.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and layouts. Notes ProfileSetup modal removed from main flow but preserved, and documents React Query configurations, role-based routing, and authentication patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, foregrounds, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with title 'NEXY_MYNDIS CONCIERGE' and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, role-based dashboard routing, onboarding flow overlay (z-60), and localStorage persistence. ProfileSetup modal logic and rendering completely removed.",
  "frontend/src/components/admin/AIMetricsOverview.tsx": "Dashboard component displaying AI agent performance metrics including validation accuracy, false positive/negative rates, processing time, and confidence scores with target thresholds and visual indicators.",
  "frontend/src/components/admin/ThresholdConfigurationPanel.tsx": "Admin panel component for configuring AI validation thresholds including budget warnings (75%, 90%, 100%), anomaly sensitivity, and compliance strictness with save/reset functionality.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages query cache clearing, and displays appropriate loading states.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Deprecated dialog component for initial user profile setup with name and email fields; preserved for potential future use but no longer actively used in main application flow.",
  "frontend/src/components/auth/RoleSelector.tsx": "Role selection interface allowing users to choose between NDIS Participant, Guardian/Carer, Service Provider, or Plan Manager roles during onboarding.",
  "frontend/src/components/common/LoadingSkeleton.tsx": "Reusable skeleton loading component with customizable width, height, and shimmer animation for placeholder content.",
  "frontend/src/components/common/LoadingState.tsx": "Loading state component with timeout detection (default 15s) that displays a spinner and offers page refresh option if loading takes too long.",
  "frontend/src/components/common/PageTransition.tsx": "Simple wrapper component that applies fade-in and slide-up animation to page content transitions.",
  "frontend/src/components/common/ScrollReveal.tsx": "Component using IntersectionObserver to animate child elements with fade and slide effects when they scroll into viewport.",
  "frontend/src/components/common/ValidationExplanationModal.tsx": "Modal dialog displaying detailed AI budget validation results including approval/rejection status, reasons, warnings, and transaction details.",
  "frontend/src/components/landing/DemoVideoSection.tsx": "Landing page section with video thumbnail and play button overlay that opens a modal to display platform demo video.",
  "frontend/src/components/landing/FeatureCardEnhanced.tsx": "Enhanced feature card with 3D mouse tilt effect, gradient animations, icon display with fallback, and hover effects for landing page features.",
  "frontend/src/components/landing/FloatingParticles.tsx": "Renders 25 animated particles that follow the mouse cursor with physics-based motion (velocity, damping, return force) on non-touch devices. Respects prefers-reduced-motion and cleans up animation frames on unmount.",
  "frontend/src/components/landing/RippleButton.tsx": "A button component that creates animated ripple effects at the click position, managing ripple state with automatic cleanup after 300ms.",
  "frontend/src/components/landing/TestimonialsCarousel.tsx": "Auto-rotating carousel displaying three testimonials with navigation dots, pause-on-hover functionality, and smooth fade transitions using a custom useCarousel hook.",
  "frontend/src/components/landing/TrustIndicators.tsx": "Displays four animated statistics cards (users, budget, satisfaction, support) with count-up animations triggered by intersection observer when scrolled into view.",
  "frontend/src/components/landing/VideoModal.tsx": "Full-screen modal overlay for displaying video content with close button, backdrop blur, and body scroll lock when open.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with brand info, quick links, legal links, and social media icons organized in a four-column grid with gradient background.",
  "frontend/src/components/layout/Header.tsx": "Fixed header with logo, role-based navigation links (dashboard, upload, providers, invoices, admin), user profile display, and mobile menu toggle. Changes appearance on scroll.",
  "frontend/src/components/layout/PageLayout.tsx": "Main layout wrapper that combines Header, Footer, and a centered content area with optional page title and gradient background.",
  "frontend/src/components/onboarding/CompletionScreen.tsx": "Displays the final onboarding screen with a success message, recommended next steps (upload plan, review budget, search providers, book appointment), and a button to navigate to the dashboard.",
  "frontend/src/components/onboarding/FeatureDemoScreen.tsx": "Shows key platform features (upload plan, find providers, book services) with icons and descriptions, includes a tip to upload NDIS plan, and provides skip/finish navigation buttons.",
  "frontend/src/components/onboarding/NDISBasicsScreen.tsx": "Educational screen explaining NDIS fundamentals including plan structure, budget categories, service providers, and plan management concepts with skip/continue navigation.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Orchestrates the multi-step onboarding flow with progress tracking, managing transitions between Welcome, NDIS Basics, Features, and Completion screens.",
  "frontend/src/components/onboarding/WelcomeScreen.tsx": "Initial onboarding screen introducing NEXY MYNDIS platform with four key features (manage plan, find providers, track goals, stay compliant) and skip/start navigation options.",
  "frontend/src/components/participant/BudgetHealthIndicator.tsx": "Displays budget health status with overall utilization percentage, color-coded health indicators (healthy/warning/critical), and active budget threshold alerts for participants.",
  "frontend/src/components/participant/BudgetSummaryCard.tsx": "Shows participant budget overview including total allocated, spent, and remaining funds with a visual progress bar and warning when utilization exceeds 80%.",
  "frontend/src/components/participant/BudgetValidationAlert.tsx": "Displays budget validation results with color-coded alerts (error/warning/success), showing reasons for rejection, warnings, predicted depletion dates, and collapsible recommended budget adjustments.",
  "frontend/src/components/participant/GoalProgressCard.tsx": "Card component that displays NDIS plan goals with progress bars (currently hardcoded to 0%), showing up to 3 goals with a count of additional goals if more exist.",
  "frontend/src/components/participant/PlanOverviewCard.tsx": "Card component displaying NDIS plan overview including plan number, active status badge, date range, goals list (up to 3), and budget categories (up to 4) with overflow indicators.",
  "frontend/src/components/participant/UpcomingBookingsCard.tsx": "Card component showing upcoming confirmed or pending bookings (up to 5), displaying service type, time slot, and status badge with color-coded borders based on booking status.",
  "frontend/src/components/provider/AnomalyWarningBanner.tsx": "Dismissible alert banner that displays AI-detected anomalies in provider invoices as a bulleted list with warning styling and a close button.",
  "frontend/src/components/provider/ProviderCard.tsx": "Card component displaying service provider details including name, NDIS verification badge, star rating, summary, service specialties, and a \"Book Service\" button that navigates to the booking page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCarousel.ts": "Custom hook providing carousel functionality with auto-advance, manual navigation (next/prev/goTo), and pause/resume controls with configurable interval timing.",
  "frontend/src/hooks/useCountUp.ts": "Custom hook that animates a number from 0 to a target value over a specified duration using cubic easing for smooth count-up animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom React hook that uses IntersectionObserver API to detect when an element enters the viewport with configurable threshold and root margin.",
  "frontend/src/hooks/useMouseTilt.ts": "Custom React hook that applies 3D tilt transform to an element based on mouse position, with automatic detection and disabling for touch devices.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that creates a parallax scrolling effect by translating an element based on scroll position, respecting user's reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, roles, participant/provider registration, bookings, invoices, budget validation, and AI agent metrics.",
  "frontend/src/hooks/useUserRole.ts": "Custom hook that wraps useGetCallerUserRole to provide convenient role checking functions (isParticipant, isGuardian, isProvider, isPlanManager, isAdmin).",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, CSS custom properties for theming (light/dark modes), typography styles using Inter and Poppins fonts, and accessibility focus styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminAIAgentDashboard.tsx": "Admin-only page displaying AI agent performance metrics, validation statistics, and threshold configuration panel with role-based access control.",
  "frontend/src/pages/BookingPage.tsx": "Page for creating service bookings with a provider, including budget validation, service selection, date/time picking, and validation explanation modal before submission.",
  "frontend/src/pages/GetStartedPage.tsx": "Role selection page that displays four NDIS user roles (Participant, Guardian, Provider, Plan Manager) with their features and navigates to registration based on the selected role. Redirects unauthenticated users to the home page.",
  "frontend/src/pages/GuardianDashboard.tsx": "Dashboard for guardians managing NDIS participants, displaying stats for participants, budgets, bookings, and budget threshold alerts. Shows budget health indicators and redirects unauthenticated users to get-started.",
  "frontend/src/pages/InvoiceCreatePage.tsx": "Form page for service providers to create invoices with line items (description, quantity, price) for NDIS participants. Converts amounts to bigint format and submits to backend.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with animated gradient backgrounds, parallax effects, floating particles, and lazy-loaded sections (testimonials, demo video). Redirects authenticated users to dashboard or get-started based on role.",
  "frontend/src/pages/ParticipantDashboard.tsx": "Main dashboard for NDIS participants showing plan overview, budget summary with totals/spent/remaining, goal progress, and upcoming bookings. Displays stats cards with budget metrics and redirects unauthenticated users.",
  "frontend/src/pages/PlanManagerDashboard.tsx": "Dashboard for plan managers overseeing multiple NDIS participants, displaying managed participants count, total budgets, compliance rate, and pending invoice approvals. Includes placeholder sections for future participant management features.",
  "frontend/src/pages/PlanUploadPage.tsx": "React component for uploading NDIS plan PDFs with progress tracking, file validation, and navigation to dashboard upon successful upload using ExternalBlob for file handling.",
  "frontend/src/pages/ProviderDashboard.tsx": "Provider dashboard page displaying bookings, invoices, revenue stats, and anomaly warnings with authentication checks and loading states.",
  "frontend/src/pages/ProvidersPage.tsx": "Searchable provider directory with filtering by service type, AI-powered recommendations based on participant's NDIS plan budget categories, and provider cards display.",
  "frontend/src/pages/RegistrationPage.tsx": "Multi-step registration form handling participant, provider, plan manager, and guardian role registration with Internet Identity authentication and profile creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including colors using OKLCH color space, typography with Inter and Poppins fonts, spacing scale, border radius values, box shadows, and container settings with responsive breakpoints.",
  "project_state.json": "Project state metadata tracking two completed features for removing a profile completion modal and its triggering logic, plus one pending feature request (AR-1) to remove the profile completion popup/modal."
}