{
  "backend/main.mo": "Main Motoko actor implementing NDIS platform backend with user profiles, participants, service providers, bookings, invoices, NDIS plans, budget management, compliance tracking, AI-powered budget validation, anomaly detection, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing scroll functionality on the onboarding tour page, including CSS inspection and router configuration verification tasks.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend TypeScript/React components covering authentication, dashboards, onboarding flow, layout components, and various feature-specific UI elements with their key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI elements including sidebar, charts, borders, and semantic colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the NEXY_MYNDIS CONCIERGE application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, role-based dashboard routing, Internet Identity authentication, ProfileSetup modal for new users, and OnboardingFlow overlay with localStorage persistence for participants.",
  "frontend/src/components/admin/AIMetricsOverview.tsx": "Dashboard component displaying AI agent performance metrics in a grid of cards showing validation accuracy, false positive/negative rates, processing time, and average confidence scores with visual indicators and target thresholds.",
  "frontend/src/components/admin/ThresholdConfigurationPanel.tsx": "Admin panel for configuring AI validation thresholds including budget warning levels (75%, 90%, 100%), anomaly sensitivity, and compliance strictness with save/reset functionality.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, clears query cache and local storage on logout, and displays appropriate loading states.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal dialog for new users to complete their profile by entering name and email, with form validation and submission to backend.",
  "frontend/src/components/auth/RoleSelector.tsx": "Onboarding component that displays role selection cards (NDIS Participant, Guardian/Carer, Service Provider, Plan Manager) and assigns the selected role to the authenticated user.",
  "frontend/src/components/common/LoadingSkeleton.tsx": "Reusable skeleton loading component with customizable width, height, and shimmer animation for placeholder content.",
  "frontend/src/components/common/LoadingState.tsx": "Centered loading state component displaying a spinning loader icon with customizable message text.",
  "frontend/src/components/common/PageTransition.tsx": "Wrapper component that applies fade-in and slide-up animation to page content on mount.",
  "frontend/src/components/common/ScrollReveal.tsx": "Component using IntersectionObserver to animate children with fade and slide effects when they scroll into viewport.",
  "frontend/src/components/common/ValidationExplanationModal.tsx": "Modal dialog that displays detailed AI validation results including transaction details, approval/rejection status, reasons for rejection, and warnings.",
  "frontend/src/components/landing/DemoVideoSection.tsx": "Landing page section with a clickable video thumbnail that opens a modal to play the platform demo video.",
  "frontend/src/components/landing/FeatureCardEnhanced.tsx": "Interactive feature card with 3D mouse tilt effect, gradient animations, icon display with fallback, and hover effects for landing page features.",
  "frontend/src/components/landing/FloatingParticles.tsx": "Renders animated floating particles that respond to mouse movement with physics-based motion (velocity, damping, attraction). Disables animation for reduced-motion preferences and touch devices.",
  "frontend/src/components/landing/RippleButton.tsx": "A button component that creates ripple effects at the click position, managing ripple state with automatic cleanup after 300ms.",
  "frontend/src/components/landing/TestimonialsCarousel.tsx": "Auto-rotating carousel displaying user testimonials with navigation dots, pause-on-hover, and smooth transitions. Includes a custom useCarousel hook for carousel logic.",
  "frontend/src/components/landing/TrustIndicators.tsx": "Displays animated statistics (users, budgets, satisfaction, support) with count-up animations triggered by intersection observer when scrolled into view.",
  "frontend/src/components/landing/VideoModal.tsx": "Modal component for displaying video content with backdrop blur, close button, and body scroll lock when open. Currently shows placeholder demo content.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with brand info, quick links, legal links, and social media icons. Includes dynamic year and app identifier for contact links.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with role-based menu items, user profile display, mobile menu toggle, and scroll-based styling. Shows different navigation options based on user role (participant, provider, admin).",
  "frontend/src/components/layout/PageLayout.tsx": "Layout wrapper component that combines Header, Footer, and main content area with optional page title and consistent container styling.",
  "frontend/src/components/onboarding/CompletionScreen.tsx": "Displays the final onboarding screen with a success message, recommended next steps (upload plan, review budget, search providers, book appointment), and a button to navigate to the dashboard.",
  "frontend/src/components/onboarding/FeatureDemoScreen.tsx": "Shows key platform features (upload plan, find providers, book services) with icons and descriptions, includes a tip to upload NDIS plan, and provides skip/finish navigation buttons.",
  "frontend/src/components/onboarding/NDISBasicsScreen.tsx": "Educational screen explaining NDIS plan fundamentals including what an NDIS plan is, budget categories, service providers, and plan management concepts with skip/continue navigation.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Orchestrates the multi-step onboarding flow with progress tracking, managing transitions between Welcome, NDIS Basics, Features, and Completion screens.",
  "frontend/src/components/onboarding/WelcomeScreen.tsx": "Initial onboarding screen introducing NEXY MYNDIS platform with four key features (manage plan, find providers, track goals, stay compliant) displayed in a grid layout with skip/start buttons.",
  "frontend/src/components/participant/BudgetHealthIndicator.tsx": "Displays budget health status with overall utilization percentage, color-coded health indicators (healthy/warning/critical), and lists active budget threshold alerts for the participant's active plan.",
  "frontend/src/components/participant/BudgetSummaryCard.tsx": "Shows budget overview card with total allocated, spent, and remaining amounts, displays utilization progress bar with color-coding, and shows warning when budget usage exceeds 80%.",
  "frontend/src/components/participant/BudgetValidationAlert.tsx": "Displays budget validation results with color-coded alerts (error/warning/success), showing reasons for rejection, warnings, predicted depletion dates, and collapsible recommended budget adjustments.",
  "frontend/src/components/participant/GoalProgressCard.tsx": "Card component that displays NDIS plan goals with progress bars (currently at 0%), showing up to 3 goals with a count of additional goals if more exist.",
  "frontend/src/components/participant/PlanOverviewCard.tsx": "Displays NDIS plan overview including plan number, active status badge, date range, goals list, and budget categories with badges.",
  "frontend/src/components/participant/UpcomingBookingsCard.tsx": "Shows a list of upcoming confirmed or pending bookings with service type, time, and status badges, displaying up to 5 appointments with loading state support.",
  "frontend/src/components/provider/AnomalyWarningBanner.tsx": "Dismissible alert banner that displays AI-detected anomalies in provider invoices with a list of detected issues and support contact prompt.",
  "frontend/src/components/provider/ProviderCard.tsx": "Provider profile card showing name, NDIS verification status, star rating, service specialties, and a 'Book Service' button that navigates to the booking page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Custom hook providing carousel functionality with auto-advance, manual navigation (next/prev/goTo), and pause/resume controls with configurable interval.",
  "frontend/src/hooks/useCountUp.ts": "Animation hook that smoothly counts up from 0 to a target number over a specified duration using cubic easing for visual effect.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useIntersectionObserver.ts": "Custom React hook that uses IntersectionObserver API to detect when a referenced element enters the viewport, with configurable threshold and root margin.",
  "frontend/src/hooks/useMouseTilt.ts": "Custom React hook that applies 3D tilt transform effects to an element based on mouse position, with smooth transitions and touch device detection.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that creates parallax scrolling effects by translating elements based on scroll position, respecting user's reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, roles, participant/provider registration, bookings, invoices, NDIS plans, budget validation, and AI agent metrics.",
  "frontend/src/hooks/useUserRole.ts": "Custom hook that wraps useGetCallerUserRole to provide convenient role checking functions (isParticipant, isGuardian, isProvider, isPlanManager, isAdmin).",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, custom CSS variables for theming (light/dark modes), typography styles using Inter and Poppins fonts, and accessibility focus styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminAIAgentDashboard.tsx": "Admin-only page displaying AI agent performance metrics, validation statistics, and threshold configuration panel with role-based access control.",
  "frontend/src/pages/BookingPage.tsx": "Page for creating service bookings with provider details, budget validation using AI agent, date/time selection, and real-time validation feedback before submission.",
  "frontend/src/pages/GetStartedPage.tsx": "Role selection page that displays four NDIS user types (Participant, Guardian, Provider, Plan Manager) with their features and navigates to registration based on selected role. Redirects to home if user is not authenticated.",
  "frontend/src/pages/GuardianDashboard.tsx": "Dashboard for guardians showing overview stats (participants count, total budgets, upcoming bookings, budget warnings) and displays budget health indicators for their managed participant. Uses queries to fetch guardian data and budget threshold alerts.",
  "frontend/src/pages/InvoiceCreatePage.tsx": "Form page for service providers to create invoices with line items (description, quantity, price), participant principal ID input, and total calculation. Submits invoice data to backend and navigates to dashboard on success.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with animated hero section, parallax effects, scroll progress indicator, lazy-loaded testimonials and demo video sections, trust indicators, and feature cards. Handles authentication and redirects based on user role.",
  "frontend/src/pages/ParticipantDashboard.tsx": "Main dashboard for NDIS participants displaying budget stats (total, spent, remaining), plan overview, budget summary, health indicators, goal progress, and upcoming bookings. Calculates totals from active plan categories.",
  "frontend/src/pages/PlanManagerDashboard.tsx": "Dashboard for plan managers showing aggregate stats across managed participants (count, total budgets, compliance rate, pending approvals) with placeholder sections for participant overview and pending invoice management.",
  "frontend/src/pages/PlanUploadPage.tsx": "React component for uploading NDIS plan PDFs with progress tracking, file validation, and navigation to dashboard upon successful upload using ExternalBlob for file handling.",
  "frontend/src/pages/ProviderDashboard.tsx": "Provider dashboard page displaying stats (bookings, revenue, ratings, flagged invoices), anomaly warnings, and placeholder sections for appointments and invoices management.",
  "frontend/src/pages/ProvidersPage.tsx": "Provider discovery page with search/filter functionality, AI-powered recommendations based on participant's NDIS plan budget categories, and provider cards display.",
  "frontend/src/pages/RegistrationPage.tsx": "Multi-step registration form handling participant, provider, plan manager, and guardian role registration with Internet Identity authentication and profile creation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with custom colors using OKLCH color space, typography (Inter/Poppins fonts), spacing scale, border radius values, shadows, and plugins for typography, container queries, and animations. Includes extensive theme customization for a component library with semantic color tokens (primary, secondary, success, warning, destructive, etc.).",
  "project_state.json": "Project state document for NEXY_MYNDIS CONCIERGE, an NDIS coordination platform built on Internet Computer with 4 role-based interfaces (Participants, Guardians, Service Providers, Plan Managers), Internet Identity auth, and manual workflows replacing AI automation. Contains one known issue: onboarding tour page becomes non-scrollable after clicking 'Get Started' button."
}